{
  "r2bewi": {
    "key": "r2bewi",
    "cardTitle": "R2BEWI",
    "cardKicker": "Démonstrateur d’architecture",
    "cardDescription": "Démonstrateur multi-SoC (ESP32 + SBC) conçu pour valider un découpage d’architecture distribuée, la gestion des frontières temps réel et la reproductibilité d’un système embarqué complexe.",
    "cardTags": [
      "Architecture  multi-SoC",
      "Frontière  temps réel",
      "Reproductibilité"
    ],
    "title": "R2BEWI : Démonstrateur d’architecture distribuée",
    "lead": "Plateforme multi-SoC conçue pour éprouver des choix d’architecture distribuée en conditions réelles et rendre les décisions techniques traçables et transmissibles.",
    "techBadges": [
      {
        "src": "/assets/images/tech/espressif.svg",
        "alt": "Espressif"
      },
      {
        "src": "/assets/images/tech/Raspberry_Pi_logo.svg",
        "alt": "Raspberry Pi"
      },
      {
        "src": "/assets/images/tech/Nvidia-jetson-Logo.svg",
        "alt": "NVIDIA Jetson"
      },
      {
        "src": "/assets/images/tech/ros.svg",
        "alt": "ROS 2"
      },
      {
        "src": "/assets/images/tech/uros.svg",
        "alt": "micro-ROS"
      }
    ],
    "sections": [
      {
        "title": "Contexte",
        "content": "R2BEWI est un banc d’essai volontairement hétérogène (ESP32, Raspberry Pi, NVIDIA Jetson) relié par ROS 2 et micro-ROS. L’objectif n’est pas la performance brute, mais la validation d’une architecture lisible : structurer la communication, clarifier le découpage des responsabilités et maintenir la cohérence d’ensemble malgré des contraintes matérielles divergentes."
      },
      {
        "title": "Rôle d’IOBEWI",
        "content": "R2BEWI a été conçu comme une preuve d’architecture. Chaque choix — découpage des couches, protocoles de communication, stratégie de validation, intégration mécanique-électronique-firmware — est explicité et documenté. Le projet sert aujourd’hui de référence concrète pour illustrer la méthode de structuration proposée aux équipes."
      },
      {
        "title": "Défis architecturaux adressés",
        "list": [
          "Faire cohabiter des SoC aux contraintes très différentes dans un même graphe ROS 2",
          "Maintenir une frontière claire entre micro-ROS temps réel et ROS 2 best-effort",
          "Explorer et itérer sans sacrifier la reproductibilité ni la lisibilité du système"
        ]
      },
      {
        "title": "Ce que R2BEWI valide",
        "content": "Architecture distribuée validée sur un socle multi-SoC intégrant contraintes temps réel, séparation claire des responsabilités et discipline d’évolution.",
        "list": [
          "Une stratégie d’intégration multi-cibles documentée et reconstruisible",
          "Un modèle clair de découpage microcontrôleur ↔ calculateur principal",
          "Une intégration mécanique-électronique-firmware pensée comme un système cohérent",
          "Des patterns directement transposables dans les projets accompagnés"
        ]
      }
    ],
    "relatedProjects": [
      {
        "title": "RHACOBOT",
        "description": "Plateforme robotique open source d’expérimentation ayant permis de formaliser les premières briques d’intégration ROS 2 et de contrôle d’actionneurs.",
        "url": "https://github.com/iobewi/rhacobot",
        "techBadges": [
          {
            "src": "/assets/images/tech/ros.svg",
            "alt": "ROS 2"
          },
          {
            "src": "/assets/images/tech/espressif.svg",
            "alt": "Espressif"
          },
          {
            "src": "/assets/images/tech/Raspberry_Pi_logo.svg",
            "alt": "Raspberry Pi"
          }
        ]
      },
      {
        "title": "TRXBEWI",
        "description": "Plateforme robotique crawler orientée perception ayant permis d’explorer l’intégration capteurs, traitement embarqué et robustesse mécanique.",
        "url": "https://github.com/iobewi/trxbewi",
        "techBadges": [
          {
            "src": "/assets/images/tech/ros.svg",
            "alt": "ROS 2"
          },
          {
            "src": "/assets/images/tech/Raspberry_Pi_logo.svg",
            "alt": "Raspberry Pi"
          },
          {
            "src": "/assets/images/tech/Nvidia-jetson-Logo.svg",
            "alt": "NVIDIA Jetson"
          }
        ]
      }
    ],
    "note": "Pour approfondir les contributions techniques et comprendre les choix d’architecture, consultez la page <a href=\"/ressources/open-source/\">Contributions open source →</a>"
  },
  "scanbewi": {
    "key": "scanbewi",
    "cardTitle": "SCANBEWI",
    "cardKicker": "Exploration usage & simplification",
    "cardTags": [
      "Pipeline embarqué",
      "Compromis usage/technique",
      "Intégration maîtrisée"
    ],
    "cardDescription": "Chaîne LiDAR embarquée orientée usage : simplification de la captation, du traitement et de la restitution 2D sous contraintes d’autonomie et d’intégration physique.",
    "title": "SCANBEWI : Chaîne LiDAR embarquée",
    "lead": "Chaîne LiDAR embarquée conçue pour produire une cartographie 2D exploitable, avec un compromis assumé entre précision, simplicité et robustesse.",
    "techBadges": [
      {
        "src": "/assets/images/tech/espressif.svg",
        "alt": "Espressif"
      },
      {
        "src": "/assets/images/tech/cicd.svg",
        "alt": "CI/CD"
      }
    ],
    "sections": [
      {
        "title": "Contexte",
        "content": "SCANBEWI explore une chaîne complète de captation et de restitution LiDAR embarquée. Le projet cible des usages non spécialistes nécessitant une représentation spatiale fiable, sans dépendre d’outils lourds ou complexes."
      },
      {
        "title": "Rôle d’IOBEWI",
        "content": "Le projet sert de support d’exploration autour de la simplification de bout en bout : acquisition, traitement, restitution, mais aussi intégration physique (boîtier, maintenance, dissipation thermique) et contraintes d’autonomie. L’objectif est de formaliser une méthode applicable à des usages métiers concrets."
      },
      {
        "title": "Contraintes principales",
        "list": [
          "Compromis précision / simplicité / temps de traitement",
          "Dépendance aux caractéristiques du capteur et à son intégration physique",
          "Restitution compréhensible pour des utilisateurs non spécialistes",
          "Contraintes de calcul embarqué et d’autonomie énergétique"
        ]
      },
      {
        "title": "Livrables / résultats",
        "list": [
          "Pipeline LiDAR embarqué simplifié et reproductible",
          "Production de cartographies 2D directement exploitables",
          "Boîtier conçu sous Fusion 360 intégrant compacité, maintenance et dissipation passive",
          "Démonstrateur orienté usage plutôt que performance métrologique",
          "Retour d’expérience structuré pour des accompagnements futurs"
        ]
      }
    ]
  }
}